<?xml version="1.0" encoding="UTF-8"?>
  <policy>
    <general>
      <name>%policy_name%</name>
      <enabled>true</enabled>
      <trigger_checkin>True</trigger_checkin>
      <frequency>Once per computer</frequency>
      <category>
        <name>%POLICY_CATEGORY%</name>
      </category>
      <site>
        <name>None</name>
      </site>
    </general>
    <scope>
      <all_computers>$ALL_COMP%</all_computers>
    </scope>
    <self_service>
      <use_for_self_service>%SELF_SERVICE%</use_for_self_service>
    </self_service>
    <package_configuration>
      <packages>
        <size>1</size>
        <package>
          <name>%pkg_name%</name>
          <action>Install</action>
        </package>
      </packages>
    </package_configuration>
    <scripts>
      <size>0</size>
    </scripts>
  </policy>

  