<?xml version="1.0" encoding="UTF-8"?>
  <os_x_configuration_profile>
    <general>
      <id>79</id>
      <name>Policy Template</name>
      <description/>
      <site>
        <id>-1</id>
        <name>None</name>
      </site>
      <category>
        <id>-1</id>
        <name>No category assigned</name>
      </category>
      <distribution_method>Install Automatically</distribution_method>
      <user_removable>false</user_removable>
      <level>System</level>
      <uuid>06BAA928-BDFA-4D05-B596-AD1B0B9580A4</uuid>
      <redeploy_on_update>Newly Assigned</redeploy_on_update>
      <payloads>&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;
&lt;plist version="1"&gt;&lt;dict&gt;&lt;key&gt;PayloadUUID&lt;/key&gt;&lt;string&gt;06BAA928-BDFA-4D05-B596-AD1B0B9580A4&lt;/string&gt;&lt;key&gt;PayloadType&lt;/key&gt;&lt;string&gt;Configuration&lt;/string&gt;&lt;key&gt;PayloadOrganization&lt;/key&gt;&lt;string&gt;Tractor Supply Company&lt;/string&gt;&lt;key&gt;PayloadIdentifier&lt;/key&gt;&lt;string&gt;06BAA928-BDFA-4D05-B596-AD1B0B9580A4&lt;/string&gt;&lt;key&gt;PayloadDisplayName&lt;/key&gt;&lt;string&gt;Policy Template&lt;/string&gt;&lt;key&gt;PayloadDescription&lt;/key&gt;&lt;string/&gt;&lt;key&gt;PayloadVersion&lt;/key&gt;&lt;integer&gt;1&lt;/integer&gt;&lt;key&gt;PayloadEnabled&lt;/key&gt;&lt;true/&gt;&lt;key&gt;PayloadRemovalDisallowed&lt;/key&gt;&lt;true/&gt;&lt;key&gt;PayloadScope&lt;/key&gt;&lt;string&gt;System&lt;/string&gt;&lt;key&gt;PayloadContent&lt;/key&gt;&lt;array/&gt;&lt;/dict&gt;&lt;/plist&gt;</payloads>
    </general>
    <scope>
      <all_computers>false</all_computers>
      <all_jss_users>false</all_jss_users>
      <computers/>
      <buildings/>
      <departments/>
      <computer_groups/>
      <jss_users/>
      <jss_user_groups/>
      <limitations>
        <users/>
        <user_groups/>
        <network_segments/>
        <ibeacons/>
      </limitations>
      <exclusions>
        <computers/>
        <buildings/>
        <departments/>
        <computer_groups/>
        <users/>
        <user_groups/>
        <network_segments/>
        <ibeacons/>
        <jss_users/>
        <jss_user_groups/>
      </exclusions>
    </scope>
    <self_service>
      <self_service_display_name>Policy Template</self_service_display_name>
      <install_button_text>Install</install_button_text>
      <self_service_description/>
      <force_users_to_view_description>false</force_users_to_view_description>
      <security>
        <removal_disallowed>Never</removal_disallowed>
      </security>
      <self_service_icon/>
      <feature_on_main_page>false</feature_on_main_page>
      <self_service_categories/>
      <notification>false</notification>
      <notification>Self Service</notification>
      <notification_subject>Policy Template</notification_subject>
      <notification_message/>
    </self_service>
  </os_x_configuration_profile>