Description: Takes packaged chrome for enterprise and uploads to JAMF instance
Identifier: com.github.yakdevinc.pkgupload.GoogleChrome
ParentRecipe: com.github.yakdevinc.autopkg.download.GoogleChrome
MinimumVersion: "2.3"

Input:
  CATEGORY: Browsers
  POLICY_CATEGORY: Updates
  
Process:

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
      sleep: 60
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"
      Sleep: 60
      replace_category: true
      
