Description: Packages version of Google Chrome that is downloaded from parent recipe and names according to vesion number.
Identifier: com.github.yakdevinc.autopk.pkg.GoogleChrome
ParentRecipe: com.github.yakdevinc.autopkg.download.GoogleChrome
MinimumVersion: "2.3"

Process:
  - Processor: FlatPkgUnpacker
    Arguments: 
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/GoogleChrome.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"

  - Processor: Plistreader
    Arguments: 
      info_path: "%RECIPE_CACHE_DIR%/unpack/Google Chrome.app"

  - Processor: PkgCopier
    Arguments: 
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/GoogleChrome-%version%.pkg"

  - Procesesor: PathDeleter
    Arguments: 
      path_list: "%RECIPE_CACHE_DIR%/unpack"


