<?xml version="1.0" encoding="UTF-8"?>

  <policy>
    <general>
      <name>%Policy_Name%</name>
      <enabled>true</enabled>
      <trigger_checkin>True</trigger_checkin>
      <category>
        <name>%POLICY_CATEGORY%</name>
      </category>
      <site>
        <name>None</name>
      </site>
    </general>
    <scope>
      <all_computers>true</all_computers>
    </scope>
    <self_service>
      <use_for_self_service>false</use_for_self_service>
    </self_service>
    <package_configuration>
      <packages>
        <size>0</size>
      </packages>
    </package_configuration>
  </policy>