Description: Takes packaged chrome for enterprise and uploads to JAMF instance
Identifier: com.github.yakdevinc.pkgupload.GoogleChrome
ParentRecipe: com.github.yakdevinc.autopkg.pkg.GoogleChrome
MinimumVersion: "2.3"

Input:
  CATEGORY: Browsers
  POLICY_CATEGORY: Updates
  POLICY_TEMPLATE: Computer_Policy_Template_wo_selfService.xml
  POLICY_NAME: LATEST %NAME% UPDATE

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
      sleep: 60
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"
      Sleep: 60
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      Policy_Name: '%POLICY_NAME%'
      policy_template: "%POLICY_TEMPLATE%"
      POLICY_CATEGORY: "%POLICY_CATEGORY%"
      pkg_name: '%pkg_name%'